## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 2 to add, 3 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.get_metrics_token_secret_value_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "get_metrics_token_secret_value_ecs_task"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL",
            ]
        }
    }

  # aws_iam_policy.get_metrics_token_secret_value_ecs_task will be created
  + resource "aws_iam_policy" "get_metrics_token_secret_value_ecs_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GetMetricstokenSecretValuePolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.secretsmanager_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "secretsmanager_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # aws_secretsmanager_secret.metrics_token will be updated in-place
  ~ resource "aws_secretsmanager_secret" "metrics_token" {
        id                      = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
        name                    = "server-metrics-token"
      + recovery_window_in_days = 30
        tags                    = {}
        # (3 unchanged attributes hidden)
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "masked_appstore_metrics_event_rule"
        name                = "masked_appstore_metrics_event_rule"
      ~ schedule_expression = "rate(1 minute)" -> "rate(24 hours)"
        tags                = {
            "Name" = "masked_appstore_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>